import BannerThin from "@/components/shared/banner-thin";
import { APP_TITLE } from "@/lib/constants";
import { membersData } from "@/lib/data";
import Image from "next/image";
import Link from "next/link";
import { PiTelegramLogo } from "react-icons/pi";
import { SlSocialInstagram, SlSocialTwitter } from "react-icons/sl";
import Dialog from "../dialog";

export const metadata = {
  title: `درباره ما - ${APP_TITLE}`,
};

export default function AboutPage() {
  return (
    <>
      <Dialog />

      {/* Mobile View */}
      <div className="relative block md:hidden">
        <BannerThin />
        {/* Banner Signature */}
        <div>
          <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="64"
            height="64"
            viewBox="0 0 32 32"
            className="absolute top-[120px] left-[10%] z-[2]"
          >
            <path
              fill="#0071CD"
              d="M19.454 27.021c-6.327 2.149-13.198-1.239-15.347-7.567s1.239-13.198 7.567-15.347c6.327-2.148 13.198 1.239 15.347 7.567s-1.239 13.198-7.567 15.347zM13.771 18.917c-0.175-0.067-0.306-0.177-0.393-0.33l-0.989-2.913-2.158 0.733 0.77 2.269c0.068 0.199 0.136 0.383 0.206 0.554 0.072 0.166 0.15 0.317 0.233 0.456 0.088 0.141 0.182 0.267 0.284 0.379 0.107 0.114 0.228 0.214 0.365 0.298 0.321 0.204 0.676 0.303 1.065 0.298 0.394-0.003 0.815-0.081 1.262-0.233l2.233-0.758c0.447-0.152 0.828-0.347 1.143-0.584 0.316-0.234 0.537-0.529 0.664-0.885 0.057-0.15 0.093-0.303 0.108-0.458 0.016-0.152 0.015-0.31-0.005-0.473-0.018-0.16-0.051-0.327-0.098-0.501-0.045-0.179-0.101-0.368-0.168-0.567l-1.74-5.124-2.153 0.731 1.959 5.768c0.010 0.088 0.005 0.173-0.015 0.255-0.019 0.086-0.051 0.168-0.096 0.246-0.039 0.061-0.090 0.112-0.152 0.153-0.061 0.044-0.126 0.082-0.195 0.114-0.068 0.035-0.138 0.065-0.209 0.089l-1.272 0.432c-0.068 0.023-0.14 0.041-0.215 0.055-0.070 0.016-0.143 0.025-0.218 0.027-0.074 0.005-0.145-0.004-0.213-0.029zM9.345 13.567l0.619 1.824 2.153-0.731-0.619-1.824-2.153 0.731zM19.509 10.116l-2.153 0.731 2.593 7.637 2.153-0.731-2.593-7.637z"
            ></path>
            <path
              fill="#f0f2f7"
              d="M13.378 18.587c0.088 0.152 0.219 0.262 0.393 0.33 0.068 0.024 0.139 0.034 0.213 0.029 0.075-0.002 0.148-0.011 0.218-0.027 0.075-0.014 0.147-0.032 0.215-0.055 0.072-0.024 0.136-0.046 0.193-0.066l0.891-0.303c0.057-0.019 0.12-0.041 0.188-0.064 0.072-0.024 0.141-0.054 0.209-0.089 0.069-0.031 0.134-0.069 0.195-0.114 0.062-0.041 0.113-0.092 0.152-0.153 0.045-0.079 0.077-0.161 0.096-0.246 0.020-0.082 0.025-0.167 0.015-0.255l-1.959-5.768 2.153-0.731 1.74 5.124c0.068 0.199 0.124 0.388 0.168 0.567 0.047 0.174 0.080 0.341 0.098 0.501 0.020 0.164 0.021 0.321 0.005 0.473-0.015 0.156-0.051 0.308-0.108 0.458-0.127 0.356-0.348 0.651-0.664 0.885-0.315 0.238-0.695 0.432-1.143 0.584l-2.233 0.758c-0.447 0.152-0.868 0.229-1.262 0.233-0.389 0.006-0.744-0.094-1.065-0.298-0.136-0.084-0.258-0.184-0.365-0.298-0.102-0.112-0.197-0.238-0.284-0.379-0.083-0.138-0.16-0.29-0.233-0.456-0.070-0.17-0.138-0.355-0.206-0.554l-0.77-2.269 2.158-0.733 0.989 2.913zM9.965 15.391l-0.619-1.824 2.153-0.731 0.619 1.824-2.153 0.731z"
            ></path>
            <path
              fill="#f0f2f7"
              d="M17.357 10.847l2.153-0.731 2.593 7.637-2.153 0.731-2.593-7.637z"
            ></path>
          </svg>
          <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="80"
            height="62"
            viewBox="0 0 42 32"
            className="absolute top-[150px] left-[8%] z-[-1]"
          >
            <path
              fill="#e8ecf3"
              d="M34.824 1.412c-0.914 0.324-1.834 0.633-2.742 0.975-3.674 1.386-7.211 3.097-10.669 4.988-5.989 3.274-11.753 6.945-17.372 10.869-0.926 0.647-1.819 1.346-2.728 2.021-0.363 0.269-0.779 0.251-1.194-0.076 0.131-0.122 0.252-0.245 0.382-0.354 1.747-1.472 3.563-2.847 5.422-4.159 4.863-3.43 9.827-6.688 15.052-9.488 4.016-2.152 8.117-4.1 12.425-5.534 0.492-0.164 0.994-0.295 1.494-0.433 0.752-0.207 1.315 0.145 1.8 0.693 0.183 0.207 0.201 0.402 0.035 0.645-0.176 0.258-0.378 0.503-0.599 0.719-1.038 1.019-2.178 1.907-3.344 2.754-2.855 2.074-5.73 4.117-8.586 6.189-6.184 4.484-12.247 9.141-18.095 14.098-0.37 0.314-0.735 0.634-1.066 1.015 0.122-0.080 0.246-0.158 0.367-0.24 3.027-2.055 6.116-4.002 9.286-5.807 5.965-3.397 12.162-6.236 18.619-8.442 1.827-0.624 3.669-1.2 5.557-1.599 0.234-0.049 0.472-0.070 0.708-0.109 0.723-0.118 1.256 0.235 1.707 0.769 0.23 0.272 0.234 0.433-0.008 0.69-0.231 0.246-0.484 0.48-0.758 0.669-1.415 0.982-2.838 1.95-4.262 2.918-3.994 2.714-7.989 5.424-11.983 8.137-0.084 0.058-0.162 0.126-0.221 0.234 0.169-0.071 0.338-0.138 0.505-0.213 2.645-1.185 5.3-2.344 8.042-3.263 1.261-0.422 2.543-0.78 3.818-1.157 0.241-0.071 0.495-0.094 0.744-0.131 0.756-0.114 1.301 0.278 1.765 0.833 0.179 0.214 0.179 0.421-0.017 0.638-0.272 0.301-0.557 0.601-0.88 0.837-0.782 0.572-1.578 1.127-2.39 1.651-1.558 1.005-3.131 1.983-4.698 2.974-0.146 0.092-0.286 0.194-0.406 0.351 0.475-0.147 0.95-0.29 1.424-0.44 2.146-0.678 4.308-1.29 6.506-1.751 0.44-0.093 0.89-0.16 1.338-0.184 0.806-0.044 1.373 0.422 1.848 1.041 0.141 0.183 0.139 0.396 0.021 0.584-0.123 0.196-0.255 0.397-0.423 0.547-0.606 0.539-1.224 1.064-1.847 1.58-1.040 0.861-2.092 1.707-3.129 2.571-0.248 0.206-0.466 0.453-0.685 0.695-0.261 0.288-0.477 0.603-0.36 1.078-0.122-0.017-0.207-0.020-0.288-0.043-0.063-0.018-0.121-0.056-0.178-0.091-0.842-0.51-0.97-1.153-0.377-1.957 0.548-0.742 1.237-1.335 1.928-1.919 0.867-0.732 1.756-1.435 2.635-2.153 0.207-0.169 0.408-0.348 0.586-0.599-0.219 0.046-0.438 0.088-0.657 0.138-2.36 0.535-4.678 1.235-6.995 1.942-0.993 0.303-1.997 0.563-2.991 0.86-0.815 0.243-1.419-0.129-1.952-0.705-0.205-0.222-0.206-0.396 0.004-0.619 0.222-0.236 0.461-0.466 0.725-0.645 1.235-0.838 2.47-1.675 3.725-2.479 1.527-0.978 3.073-1.922 4.609-2.883 0.144-0.090 0.278-0.198 0.391-0.359-0.095 0.020-0.192 0.033-0.284 0.060-3.643 1.080-7.161 2.521-10.632 4.089-2.276 1.028-4.527 2.116-6.79 3.177-0.049 0.023-0.097 0.046-0.145 0.068-0.694 0.317-1.234 0.219-1.776-0.321-0.211-0.21-0.225-0.315-0.002-0.506 0.358-0.308 0.722-0.613 1.107-0.882 1.831-1.279 3.665-2.553 5.507-3.814 3.85-2.637 7.705-5.268 11.562-7.894 1.211-0.825 2.438-1.625 3.656-2.439 0.107-0.072 0.205-0.158 0.275-0.309-0.354 0.095-0.709 0.187-1.061 0.288-4.037 1.149-7.957 2.648-11.82 4.32-6.203 2.684-12.116 5.959-17.849 9.601-1.768 1.123-3.517 2.282-5.278 3.418-0.293 0.189-0.597 0.364-0.911 0.509-0.515 0.238-0.984 0.041-1.433-0.227-0.14-0.083-0.153-0.226-0.068-0.36 0.102-0.161 0.201-0.333 0.334-0.464 0.798-0.793 1.579-1.608 2.413-2.357 2.809-2.524 5.738-4.892 8.677-7.247 5.972-4.788 12.129-9.306 18.316-13.78 1.428-1.033 2.794-2.16 4.186-3.248 0.178-0.139 0.337-0.304 0.505-0.458-0.019-0.031-0.037-0.062-0.056-0.093l0 0z"
            ></path>
          </svg>
        </div>
        {/* Page Content */}
        <div className="wrapper-about flex flex-col items-center py-20">
          <h2 className="text-primary font-bold text-[22px] absolute top-24">
            درباره ما
          </h2>
          {/* Section 1 */}
          <h3 className="text-primary font-bold text-[16px] border-t border-b w-full text-center py-4">
            درباره شرکت
          </h3>
          <div className="flex flex-col items-center gap-4 py-6">
            <p className="text-[#121215] font-semibold text-[11px] text-justify leading-6">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرده است...
            </p>
            <div className="relative flex items-center justify-center">
              <Image
                src="/images/about.png"
                alt="About Image"
                width={895}
                height={216}
              />
              <svg
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                width="45"
                height="45"
                viewBox="0 0 32 32"
                className="absolute"
              >
                <path
                  fill="#fff"
                  d="M16 32c-8.837 0-16-7.163-16-16s7.163-16 16-16c8.837 0 16 7.163 16 16s-7.163 16-16 16zM12.329 19.436c-0.19-0.159-0.307-0.352-0.352-0.58v-4.069h-3.014v3.169c0 0.278 0.007 0.538 0.022 0.781 0.020 0.238 0.052 0.461 0.097 0.669 0.050 0.213 0.115 0.412 0.195 0.595 0.085 0.188 0.195 0.364 0.33 0.528 0.315 0.392 0.717 0.667 1.207 0.826 0.495 0.164 1.055 0.245 1.679 0.245h3.119c0.625 0 1.185-0.082 1.679-0.245 0.495-0.159 0.897-0.434 1.207-0.826 0.135-0.164 0.245-0.34 0.33-0.528 0.085-0.183 0.15-0.382 0.195-0.595 0.045-0.208 0.075-0.431 0.090-0.669 0.020-0.243 0.030-0.503 0.030-0.781v-7.155h-3.006v8.055c-0.025 0.114-0.067 0.218-0.127 0.312-0.060 0.099-0.135 0.188-0.225 0.268-0.075 0.060-0.16 0.102-0.255 0.126-0.095 0.030-0.192 0.050-0.292 0.059-0.1 0.015-0.2 0.022-0.3 0.022h-1.777c-0.095 0-0.192-0.007-0.292-0.022-0.095-0.010-0.19-0.030-0.285-0.059-0.095-0.025-0.18-0.067-0.255-0.126zM9.062 10.855v2.547h3.006v-2.547h-3.006zM23.257 10.855h-3.006v10.666h3.006v-10.666z"
                ></path>
              </svg>
            </div>
          </div>
          {/* Section 2 */}
          <h3 className="text-primary font-bold text-[16px] border-t border-b w-full text-center py-4">
            فروش عمده
          </h3>
          <p className="text-[#121215] font-semibold text-[11px] text-justify leading-6 py-6">
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
            در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
            می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
            الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرده است...
          </p>
          {/* Section 3 */}
          <h3 className="text-primary font-bold text-[16px] border-t border-b w-full text-center py-4">
            واردات دستگاه های سی ان سی
          </h3>
          <p className="text-[#121215] font-semibold text-[11px] text-justify leading-6 py-6">
            نظر به درخواست زیاد از جانب مشتریان برای خرید محصولات شرکت، یدک صدرا
            اقدام به راه اندازی فروشگاه اینترنتی خود نمود تا هزینه و زمان دسترسی
            مشتریان مصرف کننده گرامی کاهش یابد و با اطمینان بیشتر خرید کنند.
          </p>
          {/* Section 4 */}
          <h3 className="text-primary font-bold text-[16px] border-t border-b w-full text-center py-4">
            اعضای شرکت
          </h3>
          <div className="grid grid-cols-2 sm:grid-cols-4 gap-10 sm:gap-0 py-6 w-full">
            {membersData.map((member) => (
              <div
                key={member.id}
                className="flex flex-col items-center gap-3 rounded-2xl px-6 py-6"
                style={{ boxShadow: "34px -4px 79px -18px rgba(0,0,0,0.1)" }}
              >
                <div className="relative">
                  <Image
                    src={member.image}
                    alt="Member Image"
                    width={55}
                    height={55}
                  />
                  <svg
                    version="1.1"
                    xmlns="http://www.w3.org/2000/svg"
                    width="18"
                    height="18"
                    viewBox="0 0 31 32"
                    className="absolute left-0 top-0"
                  >
                    <path
                      fill="#0071CD"
                      d="M19.2 21.333c-5.891 0-10.667-4.776-10.667-10.667s4.776-10.667 10.667-10.667c5.891 0 10.667 4.776 10.667 10.667s-4.776 10.667-10.667 10.667zM16.753 12.956c-0.127-0.106-0.205-0.235-0.235-0.387v-2.712h-2.009v2.112c0 0.185 0.005 0.359 0.015 0.521 0.013 0.159 0.035 0.307 0.065 0.446 0.033 0.142 0.077 0.274 0.13 0.397 0.057 0.126 0.13 0.243 0.22 0.352 0.21 0.261 0.478 0.445 0.805 0.55 0.33 0.109 0.703 0.164 1.12 0.164h2.079c0.416 0 0.79-0.055 1.12-0.164 0.33-0.106 0.598-0.289 0.805-0.55 0.090-0.109 0.163-0.226 0.22-0.352 0.057-0.122 0.1-0.255 0.13-0.397 0.030-0.139 0.050-0.288 0.060-0.446 0.013-0.162 0.020-0.336 0.020-0.521v-4.77h-2.004v5.37c-0.017 0.076-0.045 0.145-0.085 0.208-0.040 0.066-0.090 0.126-0.15 0.179-0.050 0.040-0.107 0.068-0.17 0.084-0.063 0.020-0.128 0.033-0.195 0.040-0.067 0.010-0.133 0.015-0.2 0.015h-1.185c-0.063 0-0.128-0.005-0.195-0.015-0.063-0.007-0.127-0.020-0.19-0.040-0.063-0.017-0.12-0.045-0.17-0.084zM14.575 7.235v1.698h2.004v-1.698h-2.004zM24.038 7.235h-2.004v7.111h2.004v-7.111z"
                    ></path>
                  </svg>
                </div>
                <div className="flex flex-col items-center gap-1">
                  <span className="text-black font-semibold text-[12px]">
                    {member.name}
                  </span>
                  <span className="text-secondary font-semibold text-[10px] line-clamp-1">
                    {member.position}
                  </span>
                </div>
                <hr className="w-full hidden sm:block" />
                <div className="flex items-center justify-around w-full">
                  <Link href={member.twitter}>
                    <SlSocialTwitter
                      size={15}
                      className="text-secondary hover:text-cyan-500 transition-colors duration-300 ease-in-out"
                    />
                  </Link>
                  <Link href={member.telegram}>
                    <PiTelegramLogo
                      size={15}
                      className="text-secondary hover:text-blue-600 transition-colors duration-300 ease-in-out"
                    />
                  </Link>
                  <Link href={member.instagram}>
                    <SlSocialInstagram
                      size={15}
                      className="text-secondary hover:text-pink-800 transition-colors duration-300 ease-in-out"
                    />
                  </Link>
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>

      {/* Desktop View */}
      <div className="relative hidden md:block">
        <BannerThin />
        {/* Banner Signature */}
        <div>
          <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="84"
            height="84"
            viewBox="0 0 32 32"
            className="absolute top-28 left-[18%] z-[2]"
          >
            <path
              fill="#0071CD"
              d="M19.454 27.021c-6.327 2.149-13.198-1.239-15.347-7.567s1.239-13.198 7.567-15.347c6.327-2.148 13.198 1.239 15.347 7.567s-1.239 13.198-7.567 15.347zM13.771 18.917c-0.175-0.067-0.306-0.177-0.393-0.33l-0.989-2.913-2.158 0.733 0.77 2.269c0.068 0.199 0.136 0.383 0.206 0.554 0.072 0.166 0.15 0.317 0.233 0.456 0.088 0.141 0.182 0.267 0.284 0.379 0.107 0.114 0.228 0.214 0.365 0.298 0.321 0.204 0.676 0.303 1.065 0.298 0.394-0.003 0.815-0.081 1.262-0.233l2.233-0.758c0.447-0.152 0.828-0.347 1.143-0.584 0.316-0.234 0.537-0.529 0.664-0.885 0.057-0.15 0.093-0.303 0.108-0.458 0.016-0.152 0.015-0.31-0.005-0.473-0.018-0.16-0.051-0.327-0.098-0.501-0.045-0.179-0.101-0.368-0.168-0.567l-1.74-5.124-2.153 0.731 1.959 5.768c0.010 0.088 0.005 0.173-0.015 0.255-0.019 0.086-0.051 0.168-0.096 0.246-0.039 0.061-0.090 0.112-0.152 0.153-0.061 0.044-0.126 0.082-0.195 0.114-0.068 0.035-0.138 0.065-0.209 0.089l-1.272 0.432c-0.068 0.023-0.14 0.041-0.215 0.055-0.070 0.016-0.143 0.025-0.218 0.027-0.074 0.005-0.145-0.004-0.213-0.029zM9.345 13.567l0.619 1.824 2.153-0.731-0.619-1.824-2.153 0.731zM19.509 10.116l-2.153 0.731 2.593 7.637 2.153-0.731-2.593-7.637z"
            ></path>
            <path
              fill="#f0f2f7"
              d="M13.378 18.587c0.088 0.152 0.219 0.262 0.393 0.33 0.068 0.024 0.139 0.034 0.213 0.029 0.075-0.002 0.148-0.011 0.218-0.027 0.075-0.014 0.147-0.032 0.215-0.055 0.072-0.024 0.136-0.046 0.193-0.066l0.891-0.303c0.057-0.019 0.12-0.041 0.188-0.064 0.072-0.024 0.141-0.054 0.209-0.089 0.069-0.031 0.134-0.069 0.195-0.114 0.062-0.041 0.113-0.092 0.152-0.153 0.045-0.079 0.077-0.161 0.096-0.246 0.020-0.082 0.025-0.167 0.015-0.255l-1.959-5.768 2.153-0.731 1.74 5.124c0.068 0.199 0.124 0.388 0.168 0.567 0.047 0.174 0.080 0.341 0.098 0.501 0.020 0.164 0.021 0.321 0.005 0.473-0.015 0.156-0.051 0.308-0.108 0.458-0.127 0.356-0.348 0.651-0.664 0.885-0.315 0.238-0.695 0.432-1.143 0.584l-2.233 0.758c-0.447 0.152-0.868 0.229-1.262 0.233-0.389 0.006-0.744-0.094-1.065-0.298-0.136-0.084-0.258-0.184-0.365-0.298-0.102-0.112-0.197-0.238-0.284-0.379-0.083-0.138-0.16-0.29-0.233-0.456-0.070-0.17-0.138-0.355-0.206-0.554l-0.77-2.269 2.158-0.733 0.989 2.913zM9.965 15.391l-0.619-1.824 2.153-0.731 0.619 1.824-2.153 0.731z"
            ></path>
            <path
              fill="#f0f2f7"
              d="M17.357 10.847l2.153-0.731 2.593 7.637-2.153 0.731-2.593-7.637z"
            ></path>
          </svg>
          <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="110"
            height="82"
            viewBox="0 0 42 32"
            className="absolute top-40 left-[15%] lg:left-[16%] z-[1]"
          >
            <path
              fill="#e8ecf3"
              d="M34.824 1.412c-0.914 0.324-1.834 0.633-2.742 0.975-3.674 1.386-7.211 3.097-10.669 4.988-5.989 3.274-11.753 6.945-17.372 10.869-0.926 0.647-1.819 1.346-2.728 2.021-0.363 0.269-0.779 0.251-1.194-0.076 0.131-0.122 0.252-0.245 0.382-0.354 1.747-1.472 3.563-2.847 5.422-4.159 4.863-3.43 9.827-6.688 15.052-9.488 4.016-2.152 8.117-4.1 12.425-5.534 0.492-0.164 0.994-0.295 1.494-0.433 0.752-0.207 1.315 0.145 1.8 0.693 0.183 0.207 0.201 0.402 0.035 0.645-0.176 0.258-0.378 0.503-0.599 0.719-1.038 1.019-2.178 1.907-3.344 2.754-2.855 2.074-5.73 4.117-8.586 6.189-6.184 4.484-12.247 9.141-18.095 14.098-0.37 0.314-0.735 0.634-1.066 1.015 0.122-0.080 0.246-0.158 0.367-0.24 3.027-2.055 6.116-4.002 9.286-5.807 5.965-3.397 12.162-6.236 18.619-8.442 1.827-0.624 3.669-1.2 5.557-1.599 0.234-0.049 0.472-0.070 0.708-0.109 0.723-0.118 1.256 0.235 1.707 0.769 0.23 0.272 0.234 0.433-0.008 0.69-0.231 0.246-0.484 0.48-0.758 0.669-1.415 0.982-2.838 1.95-4.262 2.918-3.994 2.714-7.989 5.424-11.983 8.137-0.084 0.058-0.162 0.126-0.221 0.234 0.169-0.071 0.338-0.138 0.505-0.213 2.645-1.185 5.3-2.344 8.042-3.263 1.261-0.422 2.543-0.78 3.818-1.157 0.241-0.071 0.495-0.094 0.744-0.131 0.756-0.114 1.301 0.278 1.765 0.833 0.179 0.214 0.179 0.421-0.017 0.638-0.272 0.301-0.557 0.601-0.88 0.837-0.782 0.572-1.578 1.127-2.39 1.651-1.558 1.005-3.131 1.983-4.698 2.974-0.146 0.092-0.286 0.194-0.406 0.351 0.475-0.147 0.95-0.29 1.424-0.44 2.146-0.678 4.308-1.29 6.506-1.751 0.44-0.093 0.89-0.16 1.338-0.184 0.806-0.044 1.373 0.422 1.848 1.041 0.141 0.183 0.139 0.396 0.021 0.584-0.123 0.196-0.255 0.397-0.423 0.547-0.606 0.539-1.224 1.064-1.847 1.58-1.040 0.861-2.092 1.707-3.129 2.571-0.248 0.206-0.466 0.453-0.685 0.695-0.261 0.288-0.477 0.603-0.36 1.078-0.122-0.017-0.207-0.020-0.288-0.043-0.063-0.018-0.121-0.056-0.178-0.091-0.842-0.51-0.97-1.153-0.377-1.957 0.548-0.742 1.237-1.335 1.928-1.919 0.867-0.732 1.756-1.435 2.635-2.153 0.207-0.169 0.408-0.348 0.586-0.599-0.219 0.046-0.438 0.088-0.657 0.138-2.36 0.535-4.678 1.235-6.995 1.942-0.993 0.303-1.997 0.563-2.991 0.86-0.815 0.243-1.419-0.129-1.952-0.705-0.205-0.222-0.206-0.396 0.004-0.619 0.222-0.236 0.461-0.466 0.725-0.645 1.235-0.838 2.47-1.675 3.725-2.479 1.527-0.978 3.073-1.922 4.609-2.883 0.144-0.090 0.278-0.198 0.391-0.359-0.095 0.020-0.192 0.033-0.284 0.060-3.643 1.080-7.161 2.521-10.632 4.089-2.276 1.028-4.527 2.116-6.79 3.177-0.049 0.023-0.097 0.046-0.145 0.068-0.694 0.317-1.234 0.219-1.776-0.321-0.211-0.21-0.225-0.315-0.002-0.506 0.358-0.308 0.722-0.613 1.107-0.882 1.831-1.279 3.665-2.553 5.507-3.814 3.85-2.637 7.705-5.268 11.562-7.894 1.211-0.825 2.438-1.625 3.656-2.439 0.107-0.072 0.205-0.158 0.275-0.309-0.354 0.095-0.709 0.187-1.061 0.288-4.037 1.149-7.957 2.648-11.82 4.32-6.203 2.684-12.116 5.959-17.849 9.601-1.768 1.123-3.517 2.282-5.278 3.418-0.293 0.189-0.597 0.364-0.911 0.509-0.515 0.238-0.984 0.041-1.433-0.227-0.14-0.083-0.153-0.226-0.068-0.36 0.102-0.161 0.201-0.333 0.334-0.464 0.798-0.793 1.579-1.608 2.413-2.357 2.809-2.524 5.738-4.892 8.677-7.247 5.972-4.788 12.129-9.306 18.316-13.78 1.428-1.033 2.794-2.16 4.186-3.248 0.178-0.139 0.337-0.304 0.505-0.458-0.019-0.031-0.037-0.062-0.056-0.093l0 0z"
            ></path>
          </svg>
        </div>
        {/* Page Layer Top-Right */}
        <div className="relative hidden xl:flex">
          <Image
            src="/images/circle-right.png"
            alt="Page Layer"
            width={220}
            height={220}
            className="absolute right-0 top-40"
          />
        </div>
        {/* Page Content */}
        <div className="wrapper-about flex flex-col items-center py-16">
          <h2 className="text-primary font-bold text-[32px] mb-10">
            درباره ما
          </h2>
          {/* Section 1 */}
          <div className="flex items-center gap-6 w-full">
            <svg
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 32 32"
            >
              <path
                fill="#015ba5"
                d="M0 16c0-8.837 7.163-16 16-16s16 7.163 16 16c0 8.837-7.163 16-16 16s-16-7.163-16-16z"
              ></path>
            </svg>
            <h3 className="text-secondary font-bold text-[20px] border-t border-b w-full py-6">
              درباره شرکت
            </h3>
          </div>
          <div className="flex flex-col items-center gap-5 w-full border-r border-dashed mr-3 py-6 pr-9 pl-3">
            <p className="text-[#121215] font-semibold text-[13px] text-justify leading-8">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرده است...
            </p>
            <div className="relative flex items-center justify-center">
              <Image
                src="/images/about.png"
                alt="About Image"
                width={895}
                height={216}
              />
              <svg
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                width="80"
                height="80"
                viewBox="0 0 32 32"
                className="absolute"
              >
                <path
                  fill="#fff"
                  d="M16 32c-8.837 0-16-7.163-16-16s7.163-16 16-16c8.837 0 16 7.163 16 16s-7.163 16-16 16zM12.329 19.436c-0.19-0.159-0.307-0.352-0.352-0.58v-4.069h-3.014v3.169c0 0.278 0.007 0.538 0.022 0.781 0.020 0.238 0.052 0.461 0.097 0.669 0.050 0.213 0.115 0.412 0.195 0.595 0.085 0.188 0.195 0.364 0.33 0.528 0.315 0.392 0.717 0.667 1.207 0.826 0.495 0.164 1.055 0.245 1.679 0.245h3.119c0.625 0 1.185-0.082 1.679-0.245 0.495-0.159 0.897-0.434 1.207-0.826 0.135-0.164 0.245-0.34 0.33-0.528 0.085-0.183 0.15-0.382 0.195-0.595 0.045-0.208 0.075-0.431 0.090-0.669 0.020-0.243 0.030-0.503 0.030-0.781v-7.155h-3.006v8.055c-0.025 0.114-0.067 0.218-0.127 0.312-0.060 0.099-0.135 0.188-0.225 0.268-0.075 0.060-0.16 0.102-0.255 0.126-0.095 0.030-0.192 0.050-0.292 0.059-0.1 0.015-0.2 0.022-0.3 0.022h-1.777c-0.095 0-0.192-0.007-0.292-0.022-0.095-0.010-0.19-0.030-0.285-0.059-0.095-0.025-0.18-0.067-0.255-0.126zM9.062 10.855v2.547h3.006v-2.547h-3.006zM23.257 10.855h-3.006v10.666h3.006v-10.666z"
                ></path>
              </svg>
            </div>
          </div>
          {/* Section 2 */}
          <div className="flex items-center gap-6 w-full">
            <svg
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 32 32"
            >
              <path
                fill="#015ba5"
                d="M0 16c0-8.837 7.163-16 16-16s16 7.163 16 16c0 8.837-7.163 16-16 16s-16-7.163-16-16z"
              ></path>
            </svg>
            <h3 className="text-secondary font-bold text-[20px] border-t border-b w-full py-6">
              فروش عمده
            </h3>
          </div>
          <div className="flex flex-col items-center gap-5 w-full border-r border-dashed mr-3 py-6 pr-9 pl-3">
            <p className="text-[#121215] font-semibold text-[13px] text-justify leading-8">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرده است...
            </p>
          </div>
          {/* Section 3 */}
          <div className="flex items-center gap-6 w-full">
            <svg
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 32 32"
            >
              <path
                fill="#015ba5"
                d="M0 16c0-8.837 7.163-16 16-16s16 7.163 16 16c0 8.837-7.163 16-16 16s-16-7.163-16-16z"
              ></path>
            </svg>
            <h3 className="text-secondary font-bold text-[20px] border-t border-b w-full py-6">
              واردات دستگاه های سی ان سی
            </h3>
          </div>
          <div className="flex flex-col items-center gap-5 w-full border-r border-dashed mr-3 py-6 pr-9 pl-3">
            <p className="text-[#121215] font-semibold text-[13px] text-justify leading-8">
              نظر به درخواست زیاد از جانب مشتریان برای خرید محصولات شرکت، یدک
              صدرا اقدام به راه اندازی فروشگاه اینترنتی خود نمود تا هزینه و زمان
              دسترسی مشتریان مصرف کننده گرامی کاهش یابد و با اطمینان بیشتر خرید
              کنند.
            </p>
          </div>
          {/* Section 4 */}
          <div className="flex items-center gap-6 w-full">
            <svg
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 32 32"
            >
              <path
                fill="#015ba5"
                d="M0 16c0-8.837 7.163-16 16-16s16 7.163 16 16c0 8.837-7.163 16-16 16s-16-7.163-16-16z"
              ></path>
            </svg>
            <h3 className="text-secondary font-bold text-[20px] border-t border-b w-full py-6">
              اعضای شرکت
            </h3>
          </div>
          <div className="flex flex-col items-center w-full mr-3 py-8 pr-9 pl-3">
            <div className="flex items-center">
              {membersData.map((member) => (
                <div
                  key={member.id}
                  className="flex flex-col items-center gap-6 rounded-2xl px-10 py-10"
                  style={{ boxShadow: "34px -4px 79px -18px rgba(0,0,0,0.1)" }}
                >
                  <div className="relative">
                    <Image
                      src={member.image}
                      alt="Member Image"
                      width={100}
                      height={100}
                    />
                    <svg
                      version="1.1"
                      xmlns="http://www.w3.org/2000/svg"
                      width="30"
                      height="30"
                      viewBox="0 0 31 32"
                      className="absolute left-0 top-0"
                    >
                      <path
                        fill="#0071CD"
                        d="M19.2 21.333c-5.891 0-10.667-4.776-10.667-10.667s4.776-10.667 10.667-10.667c5.891 0 10.667 4.776 10.667 10.667s-4.776 10.667-10.667 10.667zM16.753 12.956c-0.127-0.106-0.205-0.235-0.235-0.387v-2.712h-2.009v2.112c0 0.185 0.005 0.359 0.015 0.521 0.013 0.159 0.035 0.307 0.065 0.446 0.033 0.142 0.077 0.274 0.13 0.397 0.057 0.126 0.13 0.243 0.22 0.352 0.21 0.261 0.478 0.445 0.805 0.55 0.33 0.109 0.703 0.164 1.12 0.164h2.079c0.416 0 0.79-0.055 1.12-0.164 0.33-0.106 0.598-0.289 0.805-0.55 0.090-0.109 0.163-0.226 0.22-0.352 0.057-0.122 0.1-0.255 0.13-0.397 0.030-0.139 0.050-0.288 0.060-0.446 0.013-0.162 0.020-0.336 0.020-0.521v-4.77h-2.004v5.37c-0.017 0.076-0.045 0.145-0.085 0.208-0.040 0.066-0.090 0.126-0.15 0.179-0.050 0.040-0.107 0.068-0.17 0.084-0.063 0.020-0.128 0.033-0.195 0.040-0.067 0.010-0.133 0.015-0.2 0.015h-1.185c-0.063 0-0.128-0.005-0.195-0.015-0.063-0.007-0.127-0.020-0.19-0.040-0.063-0.017-0.12-0.045-0.17-0.084zM14.575 7.235v1.698h2.004v-1.698h-2.004zM24.038 7.235h-2.004v7.111h2.004v-7.111z"
                      ></path>
                    </svg>
                  </div>
                  <div className="flex flex-col items-center gap-1">
                    <span className="text-black font-semibold text-[16px]">
                      {member.name}
                    </span>
                    <span className="text-secondary font-semibold text-[12px] line-clamp-1">
                      {member.position}
                    </span>
                  </div>
                  <hr className="w-full" />
                  <div className="flex items-center justify-between w-full">
                    <Link href={member.twitter}>
                      <SlSocialTwitter
                        size={20}
                        className="text-secondary hover:text-cyan-500 transition-colors duration-300 ease-in-out"
                      />
                    </Link>
                    <Link href={member.telegram}>
                      <PiTelegramLogo
                        size={20}
                        className="text-secondary hover:text-blue-600 transition-colors duration-300 ease-in-out"
                      />
                    </Link>
                    <Link href={member.instagram}>
                      <SlSocialInstagram
                        size={20}
                        className="text-secondary hover:text-pink-800 transition-colors duration-300 ease-in-out"
                      />
                    </Link>
                  </div>
                </div>
              ))}
            </div>
          </div>
        </div>
        {/* Page Layer Bottom-Left */}
        <div className="relative hidden xl:flex">
          <Image
            src="/images/circle-left.png"
            alt="Page Layer"
            width={220}
            height={220}
            className="absolute left-0 bottom-40"
          />
        </div>
      </div>
    </>
  );
}
